<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;

class SettingSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $settings = [
            [
                'name' => 'address',
                'type' => 'text',
                'ar_value' => 'القصيم - البريدة - المملكة العربية السعودية',
                'en_value' => 'القصيم - البريدة - المملكة العربية السعودية',
                'page' => 'إعدادات عامة',
                'slug'=>'contact',
                'title' => 'العنوان'
            ],
            [
                'name' => 'email',
                'type' => 'email',
                'ar_value' => 'tonbike@gmail.com',
                'en_value' => 'tonbike@gmail.com',
                'page' => 'إعدادات عامة',
                'slug'=>'contact',
                'title' => 'البريد الالكتروني'
            ],
            [
                'name' => 'phone',
                'type' => 'number',
                'ar_value' => '+9665249852',
                'en_value' => '+9665249852',
                'page' => 'إعدادات عامة',
                'slug'=>'contact',
                'title' => 'رقم الجوال'
            ],
            [
                'name' => 'facebook',
                'type' => 'url',
                'ar_value' => 'https://fb.com',
                'en_value' => 'https://fb.com',
                'page' => 'إعدادات عامة',
                'slug'=>'contact',
                'title' => 'رابط الفيس بوك'
            ],
            [
                'name' => 'youtube',
                'type' => 'url',
                'ar_value' => 'https://fb.com',
                'en_value' => 'https://fb.com',
                'page' => 'إعدادات عامة',
                'slug'=>'contact',
                'title' => 'رابط اليوتيوب'
            ],
            [
                'name' => 'snap',
                'type' => 'url',
                'ar_value' => 'https://fb.com',
                'en_value' => 'https://fb.com',
                'page' => 'إعدادات عامة',
                'slug'=>'contact',
                'title' => 'رابط سناب شات'
            ],
            [
                'name' => 'instagram',
                'type' => 'url',
                'ar_value' => 'https://instagram.com',
                'en_value' => 'https://instagram.com',
                'page' => 'إعدادات عامة',
                'slug'=>'contact',
                'title' => 'رابط الإنستجرام'
            ],
            [
                'name' => 'twitter',
                'type' => 'url',
                'ar_value' => 'https://twitter.com',
                'en_value' => 'https://twitter.com',
                'page' => 'إعدادات عامة',
                'slug'=>'contact',
                'title' => 'رابط تويتر'
            ],
            [
                'name' => 'terms',
                'type' => 'long_text',
                'ar_value' => 'TONهي علامة تجارية مسـجلة لشركة الطويان للدراجات الهوائيـة التي تأسسـت عــام1403 هجـري أي أن خبرتنا تتعدى ال35 عام في مجال الدراجات الهوائية حــيث حرصنا من بداياتنا على تميّز منتجاتنا بالجودة العالية التي تطابـــق المعــايير العالميـة واستفردنا بتصــاميمنا الخاصــة والمتنوعة لتناسب جميع الأذواق والرغبات وتوفر أكبر قدر ممكن من الخيارات.',
                'en_value' => 'TONهي علامة تجارية مسـجلة لشركة الطويان للدراجات الهوائيـة التي تأسسـت عــام1403 هجـري أي أن خبرتنا تتعدى ال35 عام في مجال الدراجات الهوائية حــيث حرصنا من بداياتنا على تميّز منتجاتنا بالجودة العالية التي تطابـــق المعــايير العالميـة واستفردنا بتصــاميمنا الخاصــة والمتنوعة لتناسب جميع الأذواق والرغبات وتوفر أكبر قدر ممكن من الخيارات.',
                'page' => 'إعدادات عامة',
                'slug'=>'contact',
                'title' => 'الشروط والأحكام'
            ],
            [
                'name' => 'about',
                'type' => 'long_text',
                'ar_value' => 'TONهي علامة تجارية مسـجلة لشركة الطويان للدراجات الهوائيـة التي تأسسـت عــام1403 هجـري أي أن خبرتنا تتعدى ال35 عام في مجال الدراجات الهوائية حــيث حرصنا من بداياتنا على تميّز منتجاتنا بالجودة العالية التي تطابـــق المعــايير العالميـة واستفردنا بتصــاميمنا الخاصــة والمتنوعة لتناسب جميع الأذواق والرغبات وتوفر أكبر قدر ممكن من الخيارات.',
                'en_value' => 'TONهي علامة تجارية مسـجلة لشركة الطويان للدراجات الهوائيـة التي تأسسـت عــام1403 هجـري أي أن خبرتنا تتعدى ال35 عام في مجال الدراجات الهوائية حــيث حرصنا من بداياتنا على تميّز منتجاتنا بالجودة العالية التي تطابـــق المعــايير العالميـة واستفردنا بتصــاميمنا الخاصــة والمتنوعة لتناسب جميع الأذواق والرغبات وتوفر أكبر قدر ممكن من الخيارات.',
                'page' => 'إعدادات عامة',
                'slug'=>'contact',
                'title' => 'من نحن'
            ], [
                'name' => 'screen_one',
                'type' => 'long_text',
                'ar_value' => 'TONهي علامة تجارية مسـجلة لشركة الطويان للدراجات الهوائيـة التي تأسسـت عــام1403 هجـري أي أن خبرتنا تتعدى ال35 عام في مجال الدراجات الهوائية حــيث حرصنا من بداياتنا على تميّز منتجاتنا بالجودة العالية التي تطابـــق المعــايير العالميـة واستفردنا بتصــاميمنا الخاصــة والمتنوعة لتناسب جميع الأذواق والرغبات وتوفر أكبر قدر ممكن من الخيارات.',
                'en_value' => 'TONهي علامة تجارية مسـجلة لشركة الطويان للدراجات الهوائيـة التي تأسسـت عــام1403 هجـري أي أن خبرتنا تتعدى ال35 عام في مجال الدراجات الهوائية حــيث حرصنا من بداياتنا على تميّز منتجاتنا بالجودة العالية التي تطابـــق المعــايير العالميـة واستفردنا بتصــاميمنا الخاصــة والمتنوعة لتناسب جميع الأذواق والرغبات وتوفر أكبر قدر ممكن من الخيارات.',
                'page' => 'إعدادات عامة',
                'slug'=>'contact',
                'title' => 'نبذة الشاشة الموبايل'
            ], [
                'name' => 'screen_two',
                'type' => 'long_text',
                'ar_value' => 'TONهي علامة تجارية مسـجلة لشركة الطويان للدراجات الهوائيـة التي تأسسـت عــام1403 هجـري أي أن خبرتنا تتعدى ال35 عام في مجال الدراجات الهوائية حــيث حرصنا من بداياتنا على تميّز منتجاتنا بالجودة العالية التي تطابـــق المعــايير العالميـة واستفردنا بتصــاميمنا الخاصــة والمتنوعة لتناسب جميع الأذواق والرغبات وتوفر أكبر قدر ممكن من الخيارات.',
                'en_value' => 'TONهي علامة تجارية مسـجلة لشركة الطويان للدراجات الهوائيـة التي تأسسـت عــام1403 هجـري أي أن خبرتنا تتعدى ال35 عام في مجال الدراجات الهوائية حــيث حرصنا من بداياتنا على تميّز منتجاتنا بالجودة العالية التي تطابـــق المعــايير العالميـة واستفردنا بتصــاميمنا الخاصــة والمتنوعة لتناسب جميع الأذواق والرغبات وتوفر أكبر قدر ممكن من الخيارات.',
                'page' => 'إعدادات عامة',
                'slug'=>'contact',
                'title' => 'نبذة الشاشة الموبايل 2'
            ],


        ];

        foreach ($settings as $setting) {
            \App\Models\Setting::create($setting);
        }
    }
}
